# Python Data Frame (Pandas)

In [1]:
import pandas as pd    #python data analysis
import numpy as np     #numeric python
import matplotlib.pyplot as plt
%matplotlib inline

#read from CSV
dt_nba = pd.read_csv("data//nba.csv")
dt_nba = dt_nba.dropna(how="all") #remove all row where all data is null
dt_nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [2]:
pd.__version__

'0.22.0'

In [3]:
type(dt_nba)

pandas.core.frame.DataFrame

In [4]:
#list of column names
dt_nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [5]:
#data types of each of the data frame
dt_nba.dtypes.to_dict()

{'Name': dtype('O'),
 'Team': dtype('O'),
 'Number': dtype('float64'),
 'Position': dtype('O'),
 'Age': dtype('float64'),
 'Height': dtype('O'),
 'Weight': dtype('float64'),
 'College': dtype('O'),
 'Salary': dtype('float64')}

In [6]:
dt_nba.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            447, 448, 449, 450, 451, 452, 453, 454, 455, 456],
           dtype='int64', length=457)

In [7]:
dt_nba.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Raul Neto', 'Utah Jazz', 25.0, ..., 179.0, nan, 900000.0],
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0]],
      dtype=object)

In [8]:
#show Rows x Columns
dt_nba.shape

(457, 9)

In [9]:
dt_nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [10]:
dt_nba.axes

[Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
             ...
             447, 448, 449, 450, 451, 452, 453, 454, 455, 456],
            dtype='int64', length=457),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [11]:
#show information with regards to all datatypes of data frame.

dt_nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(4), object(5)
memory usage: 35.7+ KB

In [12]:
#COUNT on all data types

dt_nba.get_dtype_counts()

float64    4
object     5
dtype: int64

In [13]:
dt_nba.std().round(4)

Number    1.596610e+01
Age       4.404000e+00
Weight    2.636830e+01
Salary    5.229238e+06
dtype: float64

In [14]:
dt_nba.median()

Number         13.0
Age            26.0
Weight        220.0
Salary    2839073.0
dtype: float64

In [15]:
pd.options.display.float_format = '{:.4f}'.format
dt_nba.std()

Number        15.9661
Age            4.4040
Weight        26.3683
Salary   5229237.5989
dtype: float64

In [16]:
list(dt_nba)

['Name',
 'Team',
 'Number',
 'Position',
 'Age',
 'Height',
 'Weight',
 'College',
 'Salary']

In [17]:
#convert dataframe to dictionary : to get data will need to specify columns

#   dict(dt_nba)[:5] # WONT WORK

#   dict(dt_nba)["$ColumnName][:5] # WILL WORK
dict(dt_nba)["Name"][:5]

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [18]:
#convert dataframe to dictionary : to get data will need to specify columns
dict(dt_nba)["Age"][:5]

0   25.0000
1   25.0000
2   27.0000
3   22.0000
4   29.0000
Name: Age, dtype: float64

In [19]:
dt_nba.tail(5)  # head and tail

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41.0000,PF,20.0000,6-10,234.0000,Kentucky,2239800.0000
453,Shelvin Mack,Utah Jazz,8.0000,PG,26.0000,6-3,203.0000,Butler,2433333.0000
454,Raul Neto,Utah Jazz,25.0000,PG,24.0000,6-1,179.0000,NaN,900000.0000
455,Tibor Pleiss,Utah Jazz,21.0000,C,26.0000,7-3,256.0000,NaN,2900000.0000
456,Jeff Withey,Utah Jazz,24.0000,C,26.0000,7-0,231.0000,Kansas,947276.0000

## Data Extraction

### Extract Column

In [20]:
# dataframe.ColumnName <--- will not work if column has space

dt_nba.Name[:5]

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [21]:
# dataframe["ColumnName"]

dt_nba["Name"][:5]

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

### Multiple Columns

In [22]:
#the column names must be in Array
dt_nba[["Name","Team","Salary"]][:5]

            Name            Team       Salary
0  Avery Bradley  Boston Celtics 7730337.0000
1    Jae Crowder  Boston Celtics 6796117.0000
2   John Holland  Boston Celtics          nan
3    R.J. Hunter  Boston Celtics 1148640.0000
4  Jonas Jerebko  Boston Celtics 5000000.0000

In [23]:
columns_to_select = ["Name","Team","Salary"]
dt_nba[columns_to_select][:5]

            Name            Team       Salary
0  Avery Bradley  Boston Celtics 7730337.0000
1    Jae Crowder  Boston Celtics 6796117.0000
2   John Holland  Boston Celtics          nan
3    R.J. Hunter  Boston Celtics 1148640.0000
4  Jonas Jerebko  Boston Celtics 5000000.0000

### Create New Column

In [24]:

dt_nba['SalaryCopy']=dt_nba["Salary"]

dt_nba[["Name","Team","Salary","SalaryCopy"]][:5]

            Name            Team       Salary   SalaryCopy
0  Avery Bradley  Boston Celtics 7730337.0000 7730337.0000
1    Jae Crowder  Boston Celtics 6796117.0000 6796117.0000
2   John Holland  Boston Celtics          nan          nan
3    R.J. Hunter  Boston Celtics 1148640.0000 1148640.0000
4  Jonas Jerebko  Boston Celtics 5000000.0000 5000000.0000

### Create New Column with calculation

In [25]:
#Different way to do calculated fields

#1) direct
dt_nba['SalaryPlus10%A'] = dt_nba["Salary"] + (dt_nba["Salary"] * .1)

def GetSalaryIncrement(val):
    return val * 1.1

#2) function usage
dt_nba['SalaryPlus10%B'] = GetSalaryIncrement(dt_nba["Salary"])

#3) map - function
dt_nba['SalaryPlus10%C'] = dt_nba["Salary"].map(GetSalaryIncrement)

#4) apply - function
dt_nba['SalaryPlus10%D'] = dt_nba["Salary"].apply(GetSalaryIncrement)

dt_nba[["Name","Team","Salary","SalaryPlus10%A","SalaryPlus10%B","SalaryPlus10%C",'SalaryPlus10%D']][:5]

,Name,Team,Salary,SalaryPlus10%A,SalaryPlus10%B,SalaryPlus10%C,SalaryPlus10%D
0,Avery Bradley,Boston Celtics,7730337.0000,8503370.7000,8503370.7000,8503370.7000,8503370.7000
1,Jae Crowder,Boston Celtics,6796117.0000,7475728.7000,7475728.7000,7475728.7000,7475728.7000
2,John Holland,Boston Celtics,nan,nan,nan,nan,nan
3,R.J. Hunter,Boston Celtics,1148640.0000,1263504.0000,1263504.0000,1263504.0000,1263504.0000
4,Jonas Jerebko,Boston Celtics,5000000.0000,5500000.0000,5500000.0000,5500000.0000,5500000.0000

### Group By

In [26]:

#CREATE a GROUP BY SELECT
#as_index=False is needed to make the return values shown per row 
#         rather than have a parent group by structure
dt_nba[["Team","Age","Salary"]].groupby(['Team','Age'],as_index=False).mean()[:10]

             Team     Age        Salary
0   Atlanta Hawks 22.0000  1763400.0000
1   Atlanta Hawks 24.0000   944222.2500
2   Atlanta Hawks 26.0000  2000000.0000
3   Atlanta Hawks 27.0000  5666666.5000
4   Atlanta Hawks 30.0000 12000000.0000
5   Atlanta Hawks 31.0000  9809303.0000
6   Atlanta Hawks 32.0000  4000000.0000
7   Atlanta Hawks 35.0000  4300709.5000
8  Boston Celtics 20.0000  1749840.0000
9  Boston Celtics 21.0000  1170960.0000

In [27]:
#without the as_index=False >> the Team is treated as parent aggregate
dt_nba[["Team","Age","Salary"]].groupby(['Team','Age']).mean()[:10]

                              Salary
Team           Age
Atlanta Hawks  22.0000  1763400.0000
               24.0000   944222.2500
               26.0000  2000000.0000
               27.0000  5666666.5000
               30.0000 12000000.0000
               31.0000  9809303.0000
               32.0000  4000000.0000
               35.0000  4300709.5000
Boston Celtics 20.0000  1749840.0000
               21.0000  1170960.0000

### Partition By  (Apply Groupby results to individual rows)

In [28]:
#PARTITION BY = groupby + transform

#code below is equilavent to =AVG(Salary) OVER (PARTITION BY Team)
dt_nba.groupby('Team')['Salary'].transform('mean')[0:20]

0    4181504.8571
1    4181504.8571
2    4181504.8571
3    4181504.8571
4    4181504.8571
5    4181504.8571
6    4181504.8571
7    4181504.8571
8    4181504.8571
9    4181504.8571
10   4181504.8571
11   4181504.8571
12   4181504.8571
13   4181504.8571
14   4181504.8571
15   3501898.3333
16   3501898.3333
17   3501898.3333
18   3501898.3333
19   3501898.3333
Name: Salary, dtype: float64

In [29]:
#multiple partition by
dt_nba.groupby(['Team','Age'])['Salary'].transform('mean')[0:20]

0    5563871.3333
1    5563871.3333
2    5169189.5000
3    2134680.0000
4    8500000.0000
5    8500000.0000
6    1170960.0000
7    5563871.3333
8    2134680.0000
9    2134680.0000
10   2569260.0000
11   5169189.5000
12   5169189.5000
13   1749840.0000
14   2616975.0000
15   7330732.5000
16    845059.0000
17   7378758.6667
18   1237860.0000
19   6300000.0000
Name: Salary, dtype: float64

In [30]:
def GetSalaryIncrement(val):
    return val * 1.1

dt_nba['TeamAvgSalary']         =dt_nba.groupby('Team')['Salary'].transform('mean')
dt_nba['SalaryPlus10TeamAvgSal']=dt_nba.groupby('Team')['Salary'].transform('mean')*0.1+dt_nba["Salary"]

dt_nba[["Name","Team","Salary","TeamAvgSalary","SalaryPlus10TeamAvgSal"]][:20]

,Name,Team,Salary,TeamAvgSalary,SalaryPlus10TeamAvgSal
0,Avery Bradley,Boston Celtics,7730337.0000,4181504.8571,8148487.4857
1,Jae Crowder,Boston Celtics,6796117.0000,4181504.8571,7214267.4857
2,John Holland,Boston Celtics,nan,4181504.8571,nan
3,R.J. Hunter,Boston Celtics,1148640.0000,4181504.8571,1566790.4857
4,Jonas Jerebko,Boston Celtics,5000000.0000,4181504.8571,5418150.4857
5,Amir Johnson,Boston Celtics,12000000.0000,4181504.8571,12418150.4857
6,Jordan Mickey,Boston Celtics,1170960.0000,4181504.8571,1589110.4857
7,Kelly Olynyk,Boston Celtics,2165160.0000,4181504.8571,2583310.4857
8,Terry Rozier,Boston Celtics,1824360.0000,4181504.8571,2242510.4857
9,Marcus Smart,Boston Celtics,3431040.0000,4181504.8571,3849190.4857
10,Jared Sullinger,Boston Celtics,2569260.0000,4181504.8571,2987410.4857
11,Isaiah Thomas,Boston Celtics,6912869.0000,4181504.8571,7331019.4857
12,Evan Turner,Boston Celtics,3425510.0000,4181504.8571,3843660.4857
13,James Young,Boston Celtics,1749840.0000,4181504.8571,2167990.4857
14,Tyler Zeller,Boston Celtics,2616975.0000,4181504.8571,3035125.4857
15,Bojan Bogdanovic,Brooklyn Nets,3425510.0000,3501898.3333,3775699.8333
16,Markel Brown,Brooklyn Nets,845059.0000,3501898.3333,1195248.8333
17,Wayne Ellington,Brooklyn Nets,1500000.0000,3501898.3333,1850189.8333
18,Rondae Hollis-Jefferson,Brooklyn Nets,1335480.0000,3501898.3333,1685669.8333
19,Jarrett Jack,Brooklyn Nets,6300000.0000,3501898.3333,6650189.8333

### Check Number of Values - value_counts()

In [31]:
dt_nba["Position"].value_counts()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [32]:
dt_nba["Team"].value_counts().head(10)

New Orleans Pelicans     19
Memphis Grizzlies        18
Milwaukee Bucks          16
New York Knicks          16
Boston Celtics           15
Philadelphia 76ers       15
Denver Nuggets           15
Golden State Warriors    15
Los Angeles Clippers     15
Phoenix Suns             15
Name: Team, dtype: int64